results/pro6000_h100_h200_b200_01_2026/h200/concurrency_128/h200_x_8_zai-org_GLM-4.6-FP8_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     256       
Failed requests:                         0         
Maximum request concurrency:             128       
Benchmark duration (s):                  907.08    
Total input tokens:                      2048000   
Total generated tokens:                  2048000   
Request throughput (req/s):              0.28      
Output token throughput (tok/s):         2257.78   
Peak output token throughput (tok/s):    2944.00   
Peak concurrent requests:                131.00    
Total token throughput (tok/s):          4515.57   
---------------Time to First Token----------------
Mean TTFT (ms):                          13573.42  
Median TTFT (ms):                        1299.51   
P99 TTFT (ms):                           51132.70  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          54.84     
Median TPOT (ms):                        56.12     
P99 TPOT (ms):                           56.38     
---------------Inter-token Latency----------------
Mean ITL (ms):                           54.84     
Median ITL (ms):                         50.59     
P99 ITL (ms):                            414.26    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          452265.35 
Median E2EL (ms):                        450745.13 
P99 E2EL (ms):                           501950.50 
==================================================

============ Docker Compose Configuration ============
services:
  vllm_0:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              count: all
              capabilities: [gpu]
    volumes:
      - /mnt/localssd/hf_models:/mnt/localssd/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=<REDACTED>
      - HF_HOME=/mnt/localssd/hf_models
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 8
      --pipeline-parallel-size 1
      --model /mnt/localssd/hf_models/zai-org/GLM-4.6-FP8
      --served-model-name zai-org/GLM-4.6-FP8
      --max-num-seqs 512 --max-model-len 16384 --kv-cache-dtype fp8
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  benchmark:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_client
    volumes:
      - /mnt/localssd/hf_models:/mnt/localssd/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=<REDACTED>
      - HF_HOME=/mnt/localssd/hf_models
    entrypoint: ["/bin/bash", "-c"]
    command: ["sleep infinity"]
    profiles:
      - tools

============ Benchmark Command ============
vllm bench serve     --model zai-org/GLM-4.6-FP8     --dataset-name random     --random-input-len 8000     --random-output-len 8000     --max-concurrency 128     --num-prompts 256     --ignore-eos     --backend openai-chat     --endpoint /v1/chat/completions     --percentile-metrics ttft,tpot,itl,e2el     --base-url http://vllm_0:8000
==================================================